//Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
//P.s. Без создания массива
/*
void CountNum(int size)
{
    int count = 0;
    for (int i = 0; i < size;i++ )
    {
        Console.Write($"Введите число №{i+1}: ");
        int num = Convert.ToInt32(Console.ReadLine());
        if (num > 0) count++;
    }
    Console.Write($"Чисел > 0 введено {count} шт.");
}

Console.Write("Введите колличество чисел: ");
int M = Convert.ToInt32(Console.ReadLine());
CountNum(M);
*/

//Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

